<br><br><center><h1 style="font-size:2em;color:#2467C0">Tagesaufgaben: Pandas DataFrames verbinden</h1></center>
<br>

In [1]:
# Deine Imports:
import pandas as pd

1. Du hast zwei Dataframes mit Personendaten. Füge diese mittels concat zusammen und lasse dir den Inhalt ausgeben.

```

    Output:
    Alter    Stadt  Gewicht  Größe
    Name
    Anna      25   Berlin       60    170
    Ben       30  München       75    180
    Carla     22  Hamburg       55    165
    David     27     Köln       80    185

```

In [3]:
df1 = pd.DataFrame({'Alter': [25, 30, 22, 27],
                    'Stadt': ['Berlin', 'München', 'Hamburg', 'Köln']},
                    index=['Anna', 'Ben', 'Carla', 'David'])

df2 = pd.DataFrame({'Gewicht': [60, 75, 55, 80],
                    'Größe': [170, 180, 165, 185]},
                   index=['Anna', 'Ben', 'Carla', 'David'])

In [5]:
main_df = pd.concat([df1, df2], axis=1, join='outer')
main_df

       Alter    Stadt  Gewicht  Größe
Anna      25   Berlin       60    170
Ben       30  München       75    180
Carla     22  Hamburg       55    165
David     27     Köln       80    185

2. Da ist noch ein drittes Dataframe dazugekommen, blöderweise stehen dort die Namen nicht im Index... Kannst du das ändern und mit concat auch das dritte Dataframe anhängen?

In [10]:
df3 = pd.DataFrame({"Name":['Anna', 'Ben', 'Carla', 'David'],
                    'Geschlecht': ["w", "m", "w", "m"],
                    'Augenfarbe': ["braun", "braun", "blau", "grün"]
})

In [11]:
df3.set_index("Name", inplace=True)
main_df = pd.concat([main_df, df3], axis=1, join='outer')
main_df

       Alter    Stadt  Gewicht  Größe Geschlecht Augenfarbe
Anna      25   Berlin       60    170          w      braun
Ben       30  München       75    180          m      braun
Carla     22  Hamburg       55    165          w       blau
David     27     Köln       80    185          m       grün

3. Dir liegen zwei Dataframes mit Autodaten vor. Sie bilden eine fortlaufende Liste, weshalb du das erste unten an das zweite anhängen willst. Löse ebenfalls mit concat und so, dass ein fortlaufender numerischer Index für alle Auto-Einträge entsteht.

In [27]:
# DataFrame 1
cars1 = pd.DataFrame({
    'Marke': ['Audi', 'BMW', 'Mercedes-Benz', 'Audi', 'BMW', 'Mercedes-Benz', 'Audi', 'BMW', 'Mercedes-Benz'],
    'Modell': ['A3', 'X7', 'GLC', 'A5', 'M2', 'E-Klasse', 'A1', 'M4', 'CLS'],
    'Baujahr': [2015, 2017, 2018, 2016, 2015, 2019, 2014, 2017, 2019],
    'Preis': [20000, 22000, 25000, 28000, 23000, 35000, 18000, 20000, 27000],
    'Kilometerstand': [20000, 35000, 28000, 40000, 25000, 18000, 22000, 29000, 21000]
})

# DataFrame 2
cars2 = pd.DataFrame({
    'Marke': ['Volkswagen', 'Toyota', 'Mercedes-Benz', 'Audi', 'Volkswagen', 'Toyota', 'Mercedes-Benz', 'Audi', 'Volkswagen'],
    'Modell': ['Golf', 'Corolla', 'GLE', 'Q5', 'Tiguan', 'Camry', 'GLA', 'A3', 'Passat'],
    'Baujahr': [2016, 2018, 2019, 2017, 2015, 2017, 2020, 2018, 2016],
    'Preis': [18000, 19000, 28000, 31000, 15000, 17000, 40000, 22000, 19000],
    'Kilometerstand': [32000, 26000, 18000, 22000, 42000, 32000, 13000, 25000, 18000]
})

In [29]:
cars_df = pd.concat([cars1, cars2], axis=0, ignore_index=True)
cars_df

            Marke    Modell  Baujahr  Preis  Kilometerstand
0            Audi        A3     2015  20000           20000
1             BMW        X7     2017  22000           35000
2   Mercedes-Benz       GLC     2018  25000           28000
3            Audi        A5     2016  28000           40000
4             BMW        M2     2015  23000           25000
5   Mercedes-Benz  E-Klasse     2019  35000           18000
6            Audi        A1     2014  18000           22000
7             BMW        M4     2017  20000           29000
8   Mercedes-Benz       CLS     2019  27000           21000
9      Volkswagen      Golf     2016  18000           32000
10         Toyota   Corolla     2018  19000           26000
11  Mercedes-Benz       GLE     2019  28000           18000
12           Audi        Q5     2017  31000           22000
13     Volkswagen    Tiguan     2015  15000           42000
14         Toyota     Camry     2017  17000           32000
15  Mercedes-Benz       GLA     2020  40000           13000
16           Audi        A3     2018  22000           25000
17     Volkswagen    Passat     2016  19000           18000

<div  class="alert alert-block alert-info">
4. Du hast einen kleinen Auszug aus einer Videothek in Form von zwei 
Dataframes. Diese sollen zusammengefügt werden und dieses Mal mithilfe von merge.
<br> Erhebe danach noch die Spalte ID zum Index und lass dir das Ergebnis anzeigen.

    Output:

                   Titel         Regisseur  Bewertung  Anzahl Bewertungen
       ID
       1  Jurassic Park  Steven Spielberg        8.3                1000
       2  Indiana Jones  Steven Spielberg        7.6                2000
       3       Die Hard    John McTiernan        8.2                1500
       4   Forrest Gump   Robert Zemeckis        8.8                3000

</div>

In [45]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Titel': ['Jurassic Park', 'Indiana Jones', 'Die Hard', 'Forrest Gump'],
    'Regisseur': ['Steven Spielberg', 'Steven Spielberg', 'John McTiernan', 'Robert Zemeckis']
})

df2 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Bewertung': [8.3, 7.6, 8.2, 8.8],
    'Anzahl Bewertungen': [1000, 2000, 1500, 3000]
})

In [46]:
vid_df = pd.merge(df1, df2, on='ID')
vid_df.set_index('ID', inplace=True)
vid_df

            Titel         Regisseur  Bewertung  Anzahl Bewertungen
ID
1   Jurassic Park  Steven Spielberg        8.3                1000
2   Indiana Jones  Steven Spielberg        7.6                2000
3        Die Hard    John McTiernan        8.2                1500
4    Forrest Gump   Robert Zemeckis        8.8                3000

5. Du hast Daten zu Personen vorliegen und sollst diese für deinen Chef 
zusammenführen. Da dein Chef sich nur für Zahlen interessiert, willst du ihm nur Daten zu Personen vorlegen, die auch bestellt haben. Löse mit merge.

In [53]:
df1 = pd.DataFrame({
    'Name': ['Max Mustermann', 'Petra Müller', 'Hans Schmidt', 'Lisa Meyer'],
    'Adresse': ['Hauptstraße 1', 'Bahnhofstraße 2', 'Mühlenweg 3', 'Bergstraße 4']
})

df2 = pd.DataFrame({
    'Name': ['Max Mustermann', 'Petra Müller', 'Hans Schmidt'],
    'Bestellnummer': [1234, 5678, 9101],
    'Betrag': [19.99, 29.99, 49.99]
})

In [52]:
orders_df = pd.merge(df1, df2, on='Name')
orders_df

             Name          Adresse  Bestellnummer  Betrag
0  Max Mustermann    Hauptstraße 1           1234   19.99
1    Petra Müller  Bahnhofstraße 2           5678   29.99
2    Hans Schmidt      Mühlenweg 3           9101   49.99

<div  class="alert alert-block alert-info">
6. Ups. Du hast deinem Chef die Liste vorgelegt und er fragt dich: Wo sind 
die Leute, die sich für den Newsletter registriert haben, aber dann nichts bestellt haben? Das wäre ja mal was Neues, wenn alle was bestellt hätten! Du gehst zurück ans Mergen, um ihm dann eine Liste mit allen Leuten vorzulegen...

    Output:
                 Name          Adresse  Bestellnummer  Betrag
    0  Max Mustermann    Hauptstraße 1         1234.0   19.99
    1    Petra Müller  Bahnhofstraße 2         5678.0   29.99
    2    Hans Schmidt      Mühlenweg 3         9101.0   49.99
    3      Lisa Meyer     Bergstraße 4            NaN     NaN

</div>

In [54]:
orders_df2 = pd.merge(df1, df2, on='Name', how='left')
orders_df2

             Name          Adresse  Bestellnummer  Betrag
0  Max Mustermann    Hauptstraße 1         1234.0   19.99
1    Petra Müller  Bahnhofstraße 2         5678.0   29.99
2    Hans Schmidt      Mühlenweg 3         9101.0   49.99
3      Lisa Meyer     Bergstraße 4            NaN     NaN

<div  class="alert alert-block alert-info">
7. Du hast eine Liste mit Produkten (Index entspricht ihren IDs) und eine 
Liste mit Bestellungen. Du möchtest deine Bestellliste um Details zu den Produkten erweitern. Wie löst du das mit join?

    Output:
       order_id  quantity      product_name  price     brand
    1      1001         2        Messer-Set     50       WMF
    3      1002         1  Schneidebrett XL     20       WMF
    2      1003         4       Pfanne 24cm     30     Tefal
    4      1004         2    Besteck-Set 12     40  Zwilling

</div>

In [67]:
orders = pd.DataFrame({
    'order_id': [1001, 1002, 1003, 1004],
    'quantity': [2, 1, 4, 2]},
    index=[1, 3, 2, 4])

products = pd.DataFrame({
    'product_name': ['Messer-Set', 'Pfanne 24cm', 'Schneidebrett XL', 
                     'Besteck-Set 12', 'Küchenwaage', 'Bratenthermometer'],
    'price': [50, 30, 20, 40, 15, 25],
    'brand': ['WMF', 'Tefal', 'WMF', 'Zwilling', 'Soehnle', 'WMF']},
    index=[1, 2, 3, 4, 5, 6])

In [69]:
order_prod_df = orders.join(products, how='left')
order_prod_df

   order_id  quantity      product_name  price     brand
1      1001         2        Messer-Set     50       WMF
3      1002         1  Schneidebrett XL     20       WMF
2      1003         4       Pfanne 24cm     30     Tefal
4      1004         2    Besteck-Set 12     40  Zwilling

<div  class="alert alert-block alert-info">
8. Du hast wieder mal zwei Dataframes, eins mit Personen, die den Newsletter
 deiner Firma abonniert haben, das andere mit Bestellungen. Die Indices entsprechen dabei den Personen-IDs. Du willst alle Leute haben, die sowohl den Newsletter abonniert haben, als auch etwas bestellt haben und gehst das mit einem join an.

    Output:
       Name             Email  Newsletter    Product  Price
    1  John  john@example.com        True  Product A  10.99
    3  Mary  mary@example.com        True  Product C   8.99
    7   Bob   bob@example.com        True  Product E   9.99

</div>

In [110]:
newsletter = pd.DataFrame({
    'Name': ['John', 'Mary', 'Peter', 'Jane', 'Bob'],
    'Email': ['john@example.com', 'mary@example.com', 'peter@example.com', 'jane@example.com', 'bob@example.com'],
    'Newsletter': [True, True, True, False, True]},
    index=[1, 3, 4, 5, 7])

bestellungen = pd.DataFrame({
    'Product': ['Product A', 'Product B', 'Product C', 'Product D', 'Product E'],
    'Price': [10.99, 12.99, 8.99, 15.99, 9.99]},
    index=[1, 2, 3, 6, 7])

In [86]:
news_order_df = newsletter.join(bestellungen, how='inner')
news_order_df = news_order_df[news_order_df['Newsletter'] == True]
news_order_df

   Name             Email  Newsletter    Product  Price
1  John  john@example.com        True  Product A  10.99
3  Mary  mary@example.com        True  Product C   8.99
7   Bob   bob@example.com        True  Product E   9.99

<div  class="alert alert-block alert-info">
9. Aber leider sieht dein Chef das nicht so: Ich will alle sehen, brummt er 
unzufrieden. Ob Bestellung oder Newsletter, ist egal. Ich will einen Gesamtüberblick. Mich stören auch keine Leerstellen. Nun gut, du gehst zurück an deinen Arbeitsplatz, um das hier zu erhalten (mit join, bitte):

    Output:
        Name              Email Newsletter    Product  Price
    1   John   john@example.com       True  Product A  10.99
    2    NaN                NaN        NaN  Product B  12.99
    3   Mary   mary@example.com       True  Product C   8.99
    4  Peter  peter@example.com       True        NaN    NaN
    5   Jane   jane@example.com      False        NaN    NaN
    6    NaN                NaN        NaN  Product D  15.99
    7    Bob    bob@example.com       True  Product E   9.99

</div>

In [87]:
total_df = newsletter.join(bestellungen, how='outer')
total_df

    Name              Email Newsletter    Product  Price
1   John   john@example.com       True  Product A  10.99
2    NaN                NaN        NaN  Product B  12.99
3   Mary   mary@example.com       True  Product C   8.99
4  Peter  peter@example.com       True        NaN    NaN
5   Jane   jane@example.com      False        NaN    NaN
6    NaN                NaN        NaN  Product D  15.99
7    Bob    bob@example.com       True  Product E   9.99

<div  class="alert alert-block alert-info">
10. Die Stimmungsschwankungen deines Chefs sind manchmal uneträglich. Was 
ist denn das für ein Quatsch, fragt er? Was interessieren mich die Leute, die nur den Newsletter abonniert haben? Leg mir mal alle vor, die was bestellt haben. Aber natürlich interessiert mich auch, wer davon einen Newsletter bestellt hat und wer nicht. Und dings – weil ich so sadistisch bin: Ich will, dass du in beide Richtungen joinst. Ich will bisschen was für mein Geld sehen. Du bist zwar etwas verstört, wozu du zweimal dasselbe machen sollst, aber der Blick auf die Uhr verrät: Bald ist Feierabend. Also begibst du dich in den letzten Kampf.

    Output:
       Product  Price  Name             Email Newsletter
    1  Product A  10.99  John  john@example.com       True
    2  Product B  12.99   NaN               NaN        NaN
    3  Product C   8.99  Mary  mary@example.com       True
    6  Product D  15.99   NaN               NaN        NaN
    7  Product E   9.99   Bob   bob@example.com       True

In [141]:
order_news_df2 = bestellungen.join(newsletter, how='left')
news_order_df = newsletter.join(bestellungen, how='right')

In [142]:
order_news_df2

     Product  Price  Name             Email Newsletter
1  Product A  10.99  John  john@example.com       True
2  Product B  12.99   NaN               NaN        NaN
3  Product C   8.99  Mary  mary@example.com       True
6  Product D  15.99   NaN               NaN        NaN
7  Product E   9.99   Bob   bob@example.com       True